import React from "react";
import Aux from "../../hoc/Auxilary/Auxilary";
import image from "../../assets/images/photo_2023-05-18_19-52-35.jpg";
import styled from "./OurStory.css";

const OurStory = (props) => {
  return (
    <Aux>
      <div>
        <div className={styled.ourStoryTitleContainer}>
          <p className={styled.ourStoryTitle}>داستان جافارو</p>
        </div>
        <div className={styled.ourStoryContainer}>
          <img className={styled.imageOurstory} src={image} alt="ourStory" loading="lazy"  />
          <p className={styled.ourStoryTxt}>
          در زندگی ماشینی و پر از زرق و برق امروز، هر وقت سفری به روستایی یا باغی داریم، پیش خودمون میگیم کاش میشد ما هم یک درختی، باغی باغچه ای، خروس و گاو یا گوسفندی داشته باشیم. اما خب هر کدوم از این ها نگهداری و حفاظت و رسیدگی می خواد و مایی که فقط تعطیلات و آخر هفته ها رو داریم تا بتونیم این کار رو انجام بدیم از پسش برنمیایم و این میشه یه حسرتی که هربار میریم سفر دوباره برامون تازه میشه
          </p>
          <p className={styled.ourStoryTxt}>
          ما جافارویی ها هم مثل شما هر وقت رفتیم سفر این حس رو داشتیم تا فکر کردیم چطور میشه این مشکل رو حل کرد. این شد که جافارو رو راه انداختیم که همه بتونن بدون اینکه زمانی رو صرف رسیدگی به درخت و باغ و باغچه و گاو و گوسفنداشون کنن، تو تجارتی که این وسط در جریانه حضور داشته باشن و بتونن از این راه کسب درآمد کنن. جافارو از اون جایی شکل گرفت که پای حرف هر کشاورز و باغدار و دامداری که می نشست از این میگفتن که اگر یکم پول بیشتر بود میشد محصولات با کیفیت تر با هزینه و صرف انرژی کمتر تولید کرد و حرکت کرد به سمت صنعتی شدن منتها به شکل ارگانیک. این شد که ما جمع شدیم تا بتونیم بستری رو فراهم کنیم تا هم اونایی که می خوان تو بخش کشاورزی سرمایه گذاری کنن بتونن ایمن و با خیال و راحت این کار رو انجام بدن و اونایی که به سرمایه نیاز داشتن این سرمایه رو تامین کنن. پس تو هم تو داستان ما همراه شو و به خانواده جافارو بپیوند.
          </p>
        </div>
      </div>
    </Aux>
  );
};

export default OurStory;
